step-by-step/030-populate-database/020-soap/1500-устройства/0800.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Дерево -> Вставить из библиотеки -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetDeviceUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetDevice deviceTypeId="5" entityId="0" entitySpecId="1" id="0" ident="10.252.0.33"
                        invDeviceGroupIds="1" invDeviceId="7" invDeviceTypeId="2" invHost="10.252.0.33:23"
                        invIdent="10.252.0.33" omDisabled="false" parentId="5" password="" secret="">
                <comment></comment>
                <config></config>
                <host>10.252.0.33:23</host>
                <username>admin</username>
                <invConfig></invConfig>
            </inetDevice>
            <updateInvDevice>false</updateInvDevice>
        </ns5:inetDeviceUpdate>
    </S:Body>
</S:Envelope>
